; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v6)
		(pred_3 ?v1)
		(pred_5 ?v3)
		(pred_2 ?v3)
		(pred_1 ?v1 ?v3)
		(pred_4)
		(pred_6 ?v1))

   (:action op_2
       :parameters  (?v7 ?v5)
       :precondition (and (not-eq ?v7 ?v5) 
                          (pred_5 ?v7) (pred_5 ?v5) (pred_2 ?v7))
       :effect (and  (pred_2 ?v5)
		     (not (pred_2 ?v7))))


   (:action op_1
       :parameters (?v4 ?v8)
       :precondition  (and  (pred_3 ?v4) (pred_5 ?v8)
			    (pred_1 ?v4 ?v8) (pred_2 ?v8) (pred_4))
       :effect (and (pred_6 ?v4)
		    (not (pred_1 ?v4 ?v8)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v4  ?v8)
       :precondition  (and  (pred_3 ?v4) (pred_5 ?v8)
			    (pred_6 ?v4) (pred_2 ?v8))
       :effect (and (pred_1 ?v4 ?v8)
		    (pred_4)
		    (not (pred_6 ?v4)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_01 obj_02 obj_04 
          obj_03 obj_05 
)
(:init
(pred_5 obj_01)
(pred_5 obj_02)
(pred_5 obj_04)
(pred_3 obj_03)
(pred_3 obj_05)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(pred_4)
(pred_1 obj_03 obj_02)
(pred_1 obj_05 obj_01)
(pred_2 obj_04)
)
(:goal
(and
(pred_1 obj_03 obj_04)
(pred_1 obj_05 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_03 obj_04) (pred_2 obj_01))
    (sometime-before  (pred_1 obj_05 obj_02) (pred_2 obj_04))
  )
)
)

; plan
1. (op_2 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 0 of 2
2. (op_1 obj_05 obj_01)
   deleted: (pred_1 obj_05 obj_01) (pred_4)
   added: (pred_6 obj_05)
   goals met: 0 of 2
3. (op_2 obj_01 obj_02)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_02)
   goals met: 0 of 2
4. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_1 obj_05 obj_02) (pred_4)
   goals met: 1 of 2
5. (op_1 obj_03 obj_02)
   deleted: (pred_1 obj_03 obj_02) (pred_4)
   added: (pred_6 obj_03)
   goals met: 1 of 2
6. (op_2 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 1 of 2
7. (op_3 obj_03 obj_04)
   deleted: (pred_6 obj_03)
   added: (pred_1 obj_03 obj_04) (pred_4)
   goals met: 2 of 2
